export const semesterData = [
  {
    "date": "9/12",
    "name": "開源茶會",
    "difficulty": 0,
    "lecturer": "威力",
    "location": "A3-307",
    "tags": [
      "開源",
      "迎新"
    ],
    "type": "主線",
    "description": "隨著新學期的到來，許多新生已經加入了大同大學這個大家庭，相信大家都迫不及待想要探索和加入感興趣的社團。我們透過舉辦這次茶會，介紹科學開源服務社，幫助你深入了解我們的社團活動和宗旨，並希望你能成為我們大家庭的一員，共同揮灑青春！",
    "timeline": [
      "17:30~18:00 場地佈置、進場",
      "18:00~18:30 介紹科學開源服務社",
      "18:30~18:40 各組別與幹部介紹",
      "18:40~19:10 交流與享用茶點",
      "19:10~19:50 桌遊團康活動",
      "19:50~20:00 填寫問卷、收拾場地"
    ],
    "slide": "https://www.canva.com/design/DAGQPFwQnzs/qrJPlJwbXhDrviK7GhcaIg/view?utm_content=DAGQPFwQnzs&utm_campaign=designshare&utm_medium=link&utm_source=editor",
    "slido": "https://app.sli.do/event/aB84ftRiHDJBgi6CYpcQ31",
    "handout": "",
    "note": "https://hackmd.io/@ttussc/SJp-rjlnA",
    "kktix": "https://ttussc.kktix.cc/events/teaparty2024"
  },
  {
    "date": "9/19",
    "name": "開源新手村",
    "difficulty": 1,
    "lecturer": "威力",
    "location": "A3-200",
    "tags": [
      "開源"
    ],
    "type": "主線",
    "description": "在這堂課中，我們將探索開源的核心理念及其對現代科技的影響。課程將介紹開源軟體的基本原則和價值，透過實例展示如何促進創新、協作與學習。我們將討論開源專案對科學研究、軟體開發的影響，並透過 Kahoot！遊戲加深理解。歡迎對開源文化感興趣的同學一同參與！期待能夠凝聚社團的向心力，激勵每位社員積極參與社團活動。",
    "timeline": [
      "17:30~18:00：場地佈置、進場",
      "18:00~19:30：介紹開源的基本概念與重要性",
      "19:30~19:50：Kahoot！時間",
      "19:50~20:00：填寫問卷、收拾場地"
    ],
    "slide": "https://www.canva.com/design/DAGQ5_ONUM4/8bSIXCfQ4ihhEAWvy0Aobg/view?utm_content=DAGQ5_ONUM4&utm_campaign=designshare&utm_medium=link&utm_source=editor",
    "slido": "https://app.sli.do/event/3x9JxEntqCz1dXFiZ8KvzB",
    "handout": "",
    "note": "https://hackmd.io/@ttussc/Bk8ycCF30",
    "kktix": "https://ttussc.kktix.cc/events/opensrc113"
  },
  {
    "date": "9/26",
    "name": "0 到 1 的社群協作守則",
    "difficulty": 1.25,
    "lecturer": "小方",
    "location": "A3-200",
    "tags": [
      "HackMD",
      "Markdown",
      "協作"
    ],
    "type": "主線",
    "description": "MarkDown 廣泛的被使用於各大開源社群，從開發間的溝通到產品的文件，處處都有 Mark Down 的蹤影。Mark Down 除了可以快速地排版文章外，搭配 HackMD 可以變成方便的筆記工具。這次會帶大家認識 Mark Down 的撰寫方式，以及如何共筆協作。以此為媒介帶領大家入門開源的世界。",
    "timeline": [
      "17:30~18:00 場地佈置、進場",
      "18:00~18:10 開場介紹，介紹共筆文化，與為甚麼要寫共筆 (本次社課將會開一篇共筆，將為所有社員今天的筆記，編輯最多內容的社員將得到講師的小禮物喔)",
      "18:10~18:30 介紹 Mark Down 的撰寫方式",
      "18:30~18:40 實際操作練習",
      "18:40~19:10 分享與討論",
      "19:10~19:50 桌遊團康活動",
      "19:50~20:00 填寫問卷、收拾場地"
    ],
    "slide": "https://www.canva.com/design/DAGQ5_ONUM4/8bSIXCfQ4ihhEAWvy0Aobg/view?utm_content=DAGQ5_ONUM4&utm_campaign=designshare&utm_medium=link&utm_source=editor",
    "slido": "https://app.sli.do/event/3x9JxEntqCz1dXFiZ8KvzB",
    "handout": "",
    "note": "https://hackmd.io/@ttussc/Bk8ycCF30",
    "kktix": "https://ttussc.kktix.cc/events/opensrc113"
  },
  {
    "date": "10/3",
    "name": "怕麻煩的話，就 Shell 出你的指令吧",
    "difficulty": 2,
    "lecturer": "芋泥",
    "location": "A3-200",
    "tags": [
      "Linux",
      "Shell"
    ],
    "type": "主線",
    "description": "Shell 是 Linux 系統中的命令行解釋器，掌握 Shell 指令可以大大提高工作效率。這次社課將帶領大家認識 Shell 的基本概念和常用指令，並透過實際操作練習，讓大家能夠熟練運用 Shell 來管理系統和執行各種任務。",
    "timeline": [
      "17:30~18:00 場地佈置、進場",
      "18:00~18:10 開場介紹",
      "18:10~18:30 介紹 Shell 的基本概念",
      "18:30~18:40 實際操作練習",
      "18:40~19:10 分享與討論",
      "19:10~19:50 桌遊團康活動",
      "19:50~20:00 填寫問卷、收拾場地"
    ],
    "slide": "https://www.canva.com/design/DAGQ5_ONUM4/8bSIXCfQ4ihhEAWvy0Aobg/view?utm_content=DAGQ5_ONUM4&utm_campaign=designshare&utm_medium=link&utm_source=editor",
    "slido": "https://app.sli.do/event/3x9JxEntqCz1dXFiZ8KvzB",
    "handout": "",
    "note": "https://hackmd.io/@ttussc/Bk8ycCF30",
    "kktix": "https://ttussc.kktix.cc/events/opensrc113"
  },
  {
    "date": "10/7",
    "name": "Re：從 C 開始的大學生活（上）",
    "difficulty": 2,
    "lecturer": "阿文",
    "location": "A3-200",
    "tags": [
      "C",
      "程式設計"
    ],
    "type": "主線",
    "description": "C 語言是程式設計的基礎，掌握 C 語言可以為學習其他程式語言打下堅實的基礎。這次社課將帶領大家認識 C 語言的基本概念和語法，並透過實際操作練習，讓大家能夠熟練運用 C 語言來開發程式。",
    "timeline": [
      "17:30~18:00 場地佈置、進場",
      "18:00~18:10 開場介紹",
      "18:10~18:30 介紹 C 語言的基本概念",
      "18:30~18:40 實際操作練習",
      "18:40~19:10 分享與討論",
      "19:10~19:50 桌遊團康活動",
      "19:50~20:00 填寫問卷、收拾場地"
    ],
    "slide": "https://www.canva.com/design/DAGQ5_ONUM4/8bSIXCfQ4ihhEAWvy0Aobg/view?utm_content=DAGQ5_ONUM4&utm_campaign=designshare&utm_medium=link&utm_source=editor",
    "slido": "https://app.sli.do/event/3x9JxEntqCz1dXFiZ8KvzB",
    "handout": "",
    "note": "https://hackmd.io/@ttussc/Bk8ycCF30",
    "kktix": "https://ttussc.kktix.cc/events/opensrc113"
  },
  {
    "date": "10/17",
    "name": "Re：從 C 開始的大學生活（下）",
    "difficulty": 2.5,
    "lecturer": "阿文",
    "location": "A3-200",
    "tags": [
      "C",
      "程式設計"
    ],
    "type": "主線",
    "description": "C 語言是程式設計的基礎，掌握 C 語言可以為學習其他程式語言打下堅實的基礎。這次社課將帶領大家認識 C 語言的基本概念和語法，並透過實際操作練習，讓大家能夠熟練運用 C 語言來開發程式。",
    "timeline": [
      "17:30~18:00 場地佈置、進場",
      "18:00~18:10 開場介紹",
      "18:10~18:30 介紹 C 語言的基本概念",
      "18:30~18:40 實際操作練習",
      "18:40~19:10 分享與討論",
      "19:10~19:50 桌遊團康活動",
      "19:50~20:00 填寫問卷、收拾場地"
    ],
    "slide": "https://www.canva.com/design/DAGQ5_ONUM4/8bSIXCfQ4ihhEAWvy0Aobg/view?utm_content=DAGQ5_ONUM4&utm_campaign=designshare&utm_medium=link&utm_source=editor",
    "slido": "https://app.sli.do/event/3x9JxEntqCz1dXFiZ8KvzB",
    "handout": "",
    "note": "https://hackmd.io/@ttussc/Bk8ycCF30",
    "kktix": "https://ttussc.kktix.cc/events/opensrc113"
  },
  {
    "date": "10/21",
    "name": "考前讀書會",
    "difficulty": 0,
    "lecturer": "威力",
    "location": "A3 8F 樂學空間",
    "tags": [
      "工作坊",
      "讀書"
    ],
    "type": "主線",
    "description": "以往學校大考前，社團活動會暫停一次，讓社團的夥伴們專心準備大考。此次與以往不同，希望聚集社團的大家一起召開讀書會，共同為了學校大考而努力。同學與同學之間可以互相照應外，學長姐也可以協助學弟妹考試準備的方向。",
    "timeline": [
      "18:00~18:30 入座準備",
      "18:30~20:50 準備考試內容",
      "20:50~21:00 填寫回饋表單"
    ],
    "slide": "",
    "slido": "",
    "handout": "",
    "note": "",
    "kktix": ""
  },
  {
    "date": "11/4",
    "name": "Email(工作坊)",
    "difficulty": 1,
    "lecturer": "卓立教授",
    "location": "A3-206",
    "tags": [
      "工作坊",
      "Email"
    ],
    "type": "主線",
    "description": "Email 是現代人與人溝通的重要工具，掌握 Email 的使用可以大大提高工作效率。這次社課將帶領大家認識 Email 的基本概念和使用方法，並透過實際操作練習，讓大家能夠熟練運用 Email 來與人溝通和協作。",
    "timeline": [
      "17:30~18:00 場地佈置、進場",
      "18:00~18:10 開場介紹",
      "18:10~18:30 介紹 Email 的基本概念",
      "18:30~18:40 實際操作練習",
      "18:40~19:10 分享與討論",
      "19:10~19:50 桌遊團康活動",
      "19:50~20:00 填寫問卷、收拾場地"
    ],
    "slide": "https://www.canva.com/design/DAGQ5_ONUM4/8bSIXCfQ4ihhEAWvy0Aobg/view?utm_content=DAGQ5_ONUM4&utm_campaign=designshare&utm_medium=link&utm_source=editor",
    "slido": "https://app.sli.do/event/3x9JxEntqCz1dXFiZ8KvzB",
    "handout": "",
    "note": "https://hackmd.io/@ttussc/Bk8ycCF30",
    "kktix": "https://ttussc.kktix.cc/events/opensrc113"
  },
  {
    "date": "11/7",
    "name": "Arduino 微處理器入門",
    "difficulty": 2,
    "lecturer": "Allen",
    "location": "A3-200",
    "tags": [
      "Arduino"
    ],
    "type": "主線",
    "description": "Arduino 是開源硬體平台，掌握 Arduino 的使用可以為學習其他硬體平台打下堅實的基礎。這次社課將帶領大家認識 Arduino 的基本概念和使用方法，並透過實際操作練習，讓大家能夠熟練運用 Arduino 來開發各種應用。",
    "timeline": [
      "17:30~18:00 場地佈置、進場",
      "18:00~18:10 開場介紹",
      "18:10~18:30 介紹 Arduino 的基本概念",
      "18:30~18:40 實際操作練習",
      "18:40~19:10 分享與討論",
      "19:10~19:50 桌遊團康活動",
      "19:50~20:00 填寫問卷、收拾場地"
    ],
    "slide": "https://www.canva.com/design/DAGQ5_ONUM4/8bSIXCfQ4ihhEAWvy0Aobg/view?utm_content=DAGQ5_ONUM4&utm_campaign=designshare&utm_medium=link&utm_source=editor",
    "slido": "https://app.sli.do/event/3x9JxEntqCz1dXFiZ8KvzB",
    "handout": "",
    "note": "https://hackmd.io/@ttussc/Bk8ycCF30",
    "kktix": "https://ttussc.kktix.cc/events/opensrc113"
  },
  {
    "date": "11/14",
    "name": "做自己的夢，Just Do It ！",
    "difficulty": 1,
    "lecturer": "柳橙學姊",
    "location": "A3-201",
    "tags": [
      "生涯規劃",
      "職涯發展"
    ],
    "type": "支線",
    "description": "對自己未來的自己迷惘嗎？<br>可以做更多還在想什麼嗎？？<br>勇敢向前衝，做就對了！！<br><br>這堂課，邀請到了我們的校外指導老師，劉辰盈學姊，在短短時間內將帶領大家找到屬於自己想要做的事情😉<br><br>透過老師引導以及輕鬆小短片，觸動自己對未來的不可能，最後再分類出哪些屬性夢想該如何往前🤔<br><br>還在對未來很迷惘的夥伴們趕快報名起來吧～",
    "timeline": [
      "17:30~18:00 場地佈置、進場",
      "18:00~18:10 開場介紹",
      "18:10~19:00 生涯探索與規劃",
      "19:00~19:30 小組討論與分享",
      "19:30~19:50 總結與回饋",
      "19:50~20:00 填寫問卷、收拾場地"
    ],
    "slide": "",
    "slido": "",
    "handout": "",
    "note": "",
    "kktix": "https://kktix.com/events/just-do-it113"
  },
  {
    "date": "11/21",
    "name": "Arduino RFID 實戰",
    "difficulty": 3,
    "lecturer": "Allen",
    "location": "A3-200",
    "tags": [
      "Arduino",
      "創客"
    ],
    "type": "主線",
    "description": "Arduino RFID 實戰是科學開源服務社的特色活動之一，透過實際操作來學習和應用開源軟體和硬體的知識。這次社課將帶領大家認識 Arduino RFID 實戰的背景和目的，並透過實際操作練習，讓大家能夠熟練運用開源軟體和硬體來開發各種應用。",
    "timeline": [
      "17:30~18:00 場地佈置、進場",
      "18:00~18:10 開場介紹",
      "18:10~18:30 介紹 Arduino RFID 實戰的背景和目的",
      "18:30~18:40 實際操作練習",
      "18:40~19:10 分享與討論",
      "19:10~19:50 桌遊團康活動",
      "19:50~20:00 填寫問卷、收拾場地"
    ],
    "slide": "https://www.canva.com/design/DAGQ5_ONUM4/8bSIXCfQ4ihhEAWvy0Aobg/view?utm_content=DAGQ5_ONUM4&utm_campaign=designshare&utm_medium=link&utm_source=editor",
    "slido": "https://app.sli.do/event/3x9JxEntqCz1dXFiZ8KvzB",
    "handout": "",
    "note": "https://hackmd.io/@ttussc/Bk8ycCF30",
    "kktix": "https://ttussc.kktix.cc/events/opensrc113"
  },
  {
    "date": "11/28",
    "name": "作業系統生存指南",
    "difficulty": 2,
    "lecturer": "Yuto",
    "location": "A3-200",
    "tags": [
      "OS",
      "Linux"
    ],
    "type": "主線",
    "description": "作業系統是電腦運作的核心，掌握作業系統的使用可以大大提高工作效率。這次社課將帶領大家認識作業系統的基本概念和使用方法，並透過實際操作練習，讓大家能夠熟練運用作業系統來管理電腦和執行各種任務。",
    "timeline": [
      "17:30~18:00 場地佈置、進場",
      "18:00~18:10 開場介紹",
      "18:10~18:30 介紹作業系統的基本概念",
      "18:30~18:40 實際操作練習",
      "18:40~19:10 分享與討論",
      "19:10~19:50 桌遊團康活動",
      "19:50~20:00 填寫問卷、收拾場地"
    ],
    "slide": "https://www.canva.com/design/DAGQ5_ONUM4/8bSIXCfQ4ihhEAWvy0Aobg/view?utm_content=DAGQ5_ONUM4&utm_campaign=designshare&utm_medium=link&utm_source=editor",
    "slido": "https://app.sli.do/event/3x9JxEntqCz1dXFiZ8KvzB",
    "handout": "",
    "note": "https://hackmd.io/@ttussc/Bk8ycCF30",
    "kktix": "https://ttussc.kktix.cc/events/opensrc113"
  },
  {
    "date": "12/5",
    "name": "想學黑魔法嗎？我告訴你有哪些技能",
    "difficulty": 2.5,
    "lecturer": "Timothy",
    "location": "A3-307",
    "tags": [
      "資訊安全"
    ],
    "type": "主線",
    "description": "資訊安全是現代人與人溝通的重要工具，掌握資訊安全可以大大提高工作效率。這次社課將帶領大家認識資訊安全的基本概念和使用方法，並透過實際操作練習，讓大家能夠熟練運用資訊安全來保護電腦和資料。",
    "timeline": [
      "17:30~18:00 場地佈置、進場",
      "18:00~18:10 開場介紹",
      "18:10~18:30 介紹資訊安全的基本概念",
      "18:30~18:40 實際操作練習",
      "18:40~19:10 分享與討論",
      "19:10~19:50 桌遊團康活動",
      "19:50~20:00 填寫問卷、收拾場地"
    ],
    "slide": "https://www.canva.com/design/DAGQ5_ONUM4/8bSIXCfQ4ihhEAWvy0Aobg/view?utm_content=DAGQ5_ONUM4&utm_campaign=designshare&utm_medium=link&utm_source=editor",
    "slido": "https://app.sli.do/event/3x9JxEntqCz1dXFiZ8KvzB",
    "handout": "",
    "note": "https://hackmd.io/@ttussc/Bk8ycCF30",
    "kktix": "https://ttussc.kktix.cc/events/opensrc113"
  },
  {
    "date": "12/12",
    "name": "聖誕企氛，來交換禮物吧！",
    "difficulty": 0,
    "lecturer": "威力",
    "location": "A3-307",
    "tags": [
      "交換禮物"
    ],
    "type": "主線",
    "description": "親愛的社員們，快來參加我們的期末大會暨聖誕派對吧！我們將回顧本學期的精彩瞬間，並在節日氛圍中展開聖誕交換禮物活動，帶來驚喜和歡樂。不僅如此，還有豐富的輕食和飲料等你來享用。這是一場學期總結和節日慶祝的完美結合，別錯過與大家一起歡慶的機會！",
    "timeline": [
      "17:30~18:00 場地佈置與進場",
      "18:00~18:50 社團回顧與成果展示",
      "18:50~19:40 聖誕派對",
      "19:50~20:00 填寫問卷、收拾場地"
    ],
    "slide": "",
    "slido": "https://app.sli.do/event/uknkv6KpkicyQe4ai1Lwhv",
    "handout": "",
    "note": "https://hackmd.io/@ttussc/HyeSjRtnA",
    "kktix": "https://ttussc.kktix.cc/events/afterparty113"
  },
  {
    "date": "12/14",
    "name": "愛奇兒營隊",
    "difficulty": 0,
    "lecturer": "無",
    "location": "待定",
    "tags": [
      "服務",
      "營隊"
    ],
    "type": "支線",
    "description": "",
    "timeline": [],
    "slide": "",
    "slido": "",
    "handout": "",
    "note": "",
    "kktix": ""
  },
  {
    "date": "12/16",
    "name": "考前讀書會",
    "difficulty": 0,
    "lecturer": "威力",
    "location": "A3 8F 樂學空間",
    "tags": [
      "工作坊",
      "讀書"
    ],
    "type": "主線",
    "description": "以往學校大考前，社團活動會暫停一次，讓社團的夥伴們專心準備大考。此次與以往不同，希望聚集社團的大家一起召開讀書會，共同為了學校大考而努力。同學與同學之間可以互相照應外，學長姐也可以協助學弟妹考試準備的方向。",
    "timeline": [
      "18:00~18:30 入座準備",
      "18:30~20:50 準備考試內容",
      "20:50~21:00 填寫回饋表單"
    ],
    "slide": "",
    "slido": "",
    "handout": "",
    "note": "",
    "kktix": ""
  }
];
