<script setup>
</script>

<template>
  <div class="row my-5">
    <div class="col-md-8 mx-auto">
      <h1 class="mb-4">開源，開啟協作與分享的新篇章</h1>
      <p>
        在資訊爆炸與技術革新的時代，人們越來越重視智慧財產的保護，期望透過規範帶來便利與創新。然而，隨之而來的專利戰與過度保護，往往阻礙了知識的流通與技術的進步。面對這樣的現實，我們相信事情可以有另一種選擇。
      </p>

      <p>
        「開源」的本質是分享與協作。從分享智慧到推動文化進步，開源精神讓程式碼在陽光下接受檢視，讓所有人都能參與修正與改良。
        這種開放的模式不僅防範了隱私侵害與惡意程式，還促成了技術的共同進步，開啟了透明與信任的未來。
      </p>

      <h4 class="mt-4 mb-2">我們是誰？</h4>
      <p>
        科學開源服務社是以學生角度出發的社群，致力於推廣開源文化與資訊透明。我們以行動實踐開源理念，探索開源如何改善生活，改變未來。
      </p>

      <h4 class="mt-4 mb-2">我們在做什麼？</h4>

      <ul>
        <li>
          <strong>課程</strong>
          ：舉辦社課、講座與工作坊，帶領社員學習 HackMD、Linux、Git 等技術，培養實力並融入開源社群。
        </li>
        <li>
          <strong>專案</strong>：透過實作專案累積經驗，從實際應用中體會開源的價值與成就感。
        </li>
        <li>
          <strong>社群</strong>：認識志同道合的朋友，隨時揪團探討技術或參與社群活動，感受協作的魅力。
        </li>
        <li>
          <strong>服務</strong>：寒暑假舉辦資訊相關營隊，將所學回饋社群，實現服務與學習的結合。。
        </li>
      </ul>

      <h4 class="mt-4 mb-2">加入我們</h4>
      <p>
        社課的時間和資訊會在每學期公告於網站上，每個禮拜 IG 上也會貼文公告。歡迎一同加入科學開源服務社，探索開源的世界，讓分享與協作成為你的日常！關注我們的最新活動，讓我們一起用開源改變未來！
      </p>
    </div>
  </div>
</template>