<script setup>
</script>

<template>
  <div class="row">
    <div class="col-md-8 mx-auto my-5">
      <h1>Lecture</h1>
      <p>
        在科學開源服務社的社課中，我們為社員提供多元且富挑戰性的學習體驗。為了方便大家選擇感興趣的活動，課程難度從🌑🌑🌑🌑🌑到🌕🌕🌕🌕🌕一共分為六個等級：
      </p>

      <ul>
        <li>🌑🌑🌑🌑🌑：一般性質活動，任何人都可以一同參與。</li>
        <li>🌕🌑🌑🌑🌑：非常簡單，適合完全新手，無需任何背景知識。</li>
        <li>🌕🌕🌑🌑🌑：簡單，需具備基本概念或基礎能力。</li>
        <li>🌕🌕🌕🌑🌑：中等，內容稍具挑戰性，適合已有相關經驗的人。</li>
        <li>🌕🌕🌕🌕🌑：困難，需要較多背景知識或具備一定專業技能。</li>
        <li>🌕🌕🌕🌕🌕：非常困難，適合高水準的學習者或專業人士。</li>
      </ul>

      <p>
        我們的社課適合各種學習者，內容包括基礎技能教學，如程式語言與軟體使用，實作課程，如網頁開發與機器學習，還有輕鬆類活動如社交與讀書會，讓大家在輕鬆愉快的氛圍中學習與成長。更邀請業界專家分享最新資訊與實戰經驗，拓展視野。無論你是初學者還是資深學習者，這裡都有適合你的課程，帶你一探開源世界的無限可能！
      </p>
    </div>
  </div>
</template>